add workflow patterns docs
